Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/tram.h
#define TRAM_RAM1998_REG_OFST          _UINT32_(0x2F38)    /* (TRAM_RAM1998) TrustRAM Offset */
#define TRAM_RAM1999_REG_OFST          _UINT32_(0x2F3C)    /* (TRAM_RAM1999) TrustRAM Offset */
#define TRAM_RAM2000_REG_OFST          _UINT32_(0x2F40)    /* (TRAM_RAM2000) TrustRAM Offset */
#define TRAM_RAM2001_REG_OFST          _UINT32_(0x2F44)    /* (TRAM_RAM2001) TrustRAM Offset */
#define TRAM_RAM2002_REG_OFST          _UINT32_(0x2F48)    /* (TRAM_RAM2002) TrustRAM Offset */
#define TRAM_RAM2003_REG_OFST          _UINT32_(0x2F4C)    /* (TRAM_RAM2003) TrustRAM Offset */
#define TRAM_RAM2004_REG_OFST          _UINT32_(0x2F50)    /* (TRAM_RAM2004) TrustRAM Offset */
#define TRAM_RAM2005_REG_OFST          _UINT32_(0x2F54)    /* (TRAM_RAM2005) TrustRAM Offset */
#define TRAM_RAM2006_REG_OFST          _UINT32_(0x2F58)    /* (TRAM_RAM2006) TrustRAM Offset */
#define TRAM_RAM2007_REG_OFST          _UINT32_(0x2F5C)    /* (TRAM_RAM2007) TrustRAM Offset */
#define TRAM_RAM2008_REG_OFST          _UINT32_(0x2F60)    /* (TRAM_RAM2008) TrustRAM Offset */
#define TRAM_RAM2009_REG_OFST          _UINT32_(0x2F64)    /* (TRAM_RAM2009) TrustRAM Offset */
#define TRAM_RAM2010_REG_OFST          _UINT32_(0x2F68)    /* (TRAM_RAM2010) TrustRAM Offset */
#define TRAM_RAM2011_REG_OFST          _UINT32_(0x2F6C)    /* (TRAM_RAM2011) TrustRAM Offset */
#define TRAM_RAM2012_REG_OFST          _UINT32_(0x2F70)    /* (TRAM_RAM2012) TrustRAM Offset */
#define TRAM_RAM2013_REG_OFST          _UINT32_(0x2F74)    /* (TRAM_RAM2013) TrustRAM Offset */
#define TRAM_RAM2014_REG_OFST          _UINT32_(0x2F78)    /* (TRAM_RAM2014) TrustRAM Offset */
#define TRAM_RAM2015_REG_OFST          _UINT32_(0x2F7C)    /* (TRAM_RAM2015) TrustRAM Offset */
#define TRAM_RAM2016_REG_OFST          _UINT32_(0x2F80)    /* (TRAM_RAM2016) TrustRAM Offset */
#define TRAM_RAM2017_REG_OFST          _UINT32_(0x2F84)    /* (TRAM_RAM2017) TrustRAM Offset */
#define TRAM_RAM2018_REG_OFST          _UINT32_(0x2F88)    /* (TRAM_RAM2018) TrustRAM Offset */
#define TRAM_RAM2019_REG_OFST          _UINT32_(0x2F8C)    /* (TRAM_RAM2019) TrustRAM Offset */
#define TRAM_RAM2020_REG_OFST          _UINT32_(0x2F90)    /* (TRAM_RAM2020) TrustRAM Offset */
#define TRAM_RAM2021_REG_OFST          _UINT32_(0x2F94)    /* (TRAM_RAM2021) TrustRAM Offset */
#define TRAM_RAM2022_REG_OFST          _UINT32_(0x2F98)    /* (TRAM_RAM2022) TrustRAM Offset */
#define TRAM_RAM2023_REG_OFST          _UINT32_(0x2F9C)    /* (TRAM_RAM2023) TrustRAM Offset */
#define TRAM_RAM2024_REG_OFST          _UINT32_(0x2FA0)    /* (TRAM_RAM2024) TrustRAM Offset */
#define TRAM_RAM2025_REG_OFST          _UINT32_(0x2FA4)    /* (TRAM_RAM2025) TrustRAM Offset */
#define TRAM_RAM2026_REG_OFST          _UINT32_(0x2FA8)    /* (TRAM_RAM2026) TrustRAM Offset */
#define TRAM_RAM2027_REG_OFST          _UINT32_(0x2FAC)    /* (TRAM_RAM2027) TrustRAM Offset */
#define TRAM_RAM2028_REG_OFST          _UINT32_(0x2FB0)    /* (TRAM_RAM2028) TrustRAM Offset */
#define TRAM_RAM2029_REG_OFST          _UINT32_(0x2FB4)    /* (TRAM_RAM2029) TrustRAM Offset */
#define TRAM_RAM2030_REG_OFST          _UINT32_(0x2FB8)    /* (TRAM_RAM2030) TrustRAM Offset */
#define TRAM_RAM2031_REG_OFST          _UINT32_(0x2FBC)    /* (TRAM_RAM2031) TrustRAM Offset */
#define TRAM_RAM2032_REG_OFST          _UINT32_(0x2FC0)    /* (TRAM_RAM2032) TrustRAM Offset */
#define TRAM_RAM2033_REG_OFST          _UINT32_(0x2FC4)    /* (TRAM_RAM2033) TrustRAM Offset */
#define TRAM_RAM2034_REG_OFST          _UINT32_(0x2FC8)    /* (TRAM_RAM2034) TrustRAM Offset */
#define TRAM_RAM2035_REG_OFST          _UINT32_(0x2FCC)    /* (TRAM_RAM2035) TrustRAM Offset */
#define TRAM_RAM2036_REG_OFST          _UINT32_(0x2FD0)    /* (TRAM_RAM2036) TrustRAM Offset */
#define TRAM_RAM2037_REG_OFST          _UINT32_(0x2FD4)    /* (TRAM_RAM2037) TrustRAM Offset */
#define TRAM_RAM2038_REG_OFST          _UINT32_(0x2FD8)    /* (TRAM_RAM2038) TrustRAM Offset */
#define TRAM_RAM2039_REG_OFST          _UINT32_(0x2FDC)    /* (TRAM_RAM2039) TrustRAM Offset */
#define TRAM_RAM2040_REG_OFST          _UINT32_(0x2FE0)    /* (TRAM_RAM2040) TrustRAM Offset */
#define TRAM_RAM2041_REG_OFST          _UINT32_(0x2FE4)    /* (TRAM_RAM2041) TrustRAM Offset */
#define TRAM_RAM2042_REG_OFST          _UINT32_(0x2FE8)    /* (TRAM_RAM2042) TrustRAM Offset */
#define TRAM_RAM2043_REG_OFST          _UINT32_(0x2FEC)    /* (TRAM_RAM2043) TrustRAM Offset */
#define TRAM_RAM2044_REG_OFST          _UINT32_(0x2FF0)    /* (TRAM_RAM2044) TrustRAM Offset */
#define TRAM_RAM2045_REG_OFST          _UINT32_(0x2FF4)    /* (TRAM_RAM2045) TrustRAM Offset */
#define TRAM_RAM2046_REG_OFST          _UINT32_(0x2FF8)    /* (TRAM_RAM2046) TrustRAM Offset */
#define TRAM_RAM2047_REG_OFST          _UINT32_(0x2FFC)    /* (TRAM_RAM2047) TrustRAM Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief TRAM register API structure */
typedef struct
{  /* TrustRAM */
  __IO  uint32_t                       TRAM_CTRLA;         /**< Offset: 0x00 (R/W  32) Control */
  __IO  uint32_t                       TRAM_INTENCLR;      /**< Offset: 0x04 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       TRAM_INTENSET;      /**< Offset: 0x08 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       TRAM_INTFLAG;       /**< Offset: 0x0C (R/W  32) Interrupt Flag Status and Clear */
  __I   uint32_t                       TRAM_STATUS;        /**< Offset: 0x10 (R/   32) Status */
  __I   uint32_t                       TRAM_SYNCBUSY;      /**< Offset: 0x14 (R/   32) Synchronization Busy Status */
  __O   uint32_t                       TRAM_DSCC;          /**< Offset: 0x18 ( /W  32) Data Scramble Control */
  __O   uint32_t                       TRAM_PERMW;         /**< Offset: 0x1C ( /W  32) Permutation Write */
  __I   uint32_t                       TRAM_PERMR;         /**< Offset: 0x20 (R/   32) Permutation Read */
  __I   uint8_t                        Reserved1[0xFDC];
  __IO  uint32_t                       TRAM_RAM[2048];     /**< Offset: 0x1000 (R/W  32) TrustRAM */
} tram_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CKGC01_TRAM_COMPONENT_H_ */
